# Install everything with `brew bundle`

tap "hashicorp/tap"

# Essentials
brew "git"
brew "gh"
brew "wget"
brew "jq"
brew "tree"
brew "tmux"

# Modern CLI replacements
brew "ripgrep"   # grep
brew "fd"        # find
brew "bat"       # cat
brew "eza"       # ls
brew "fzf"       # fuzzy-find everything (Ctrl-R / Ctrl-T)
brew "zoxide"    # smarter cd
brew "git-delta" # nicer git diffs
brew "lazygit"

# Shell
brew "starship"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"

# Runtime versions (replaces nvm, rvm, sdkman)
brew "mise"

# Work
brew "awscli"
brew "kubernetes-cli"
brew "helm"
brew "hashicorp/tap/terraform"
brew "go"
brew "redis"
cask "aws-vault"
cask "ngrok"

# Apps
cask "ghostty"
